FV2510/E_0025.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

footer
v4.1 | 11.12.2025 (urspr. 01.04.2025)
endfooter

title
MaBiS

7.44.2: AD: Übermittlung Prüfmitteilung für die Bilanzkreissummenzeitreihe vom BKV an BIKO und ÜNB



end title
:<b>E_0025</b>;
note right
<b><i>Prüfende Rolle: BIKO
end note

if (<b>1: </b> Erfolgt der Eingang der Prüfmitteilung nach Ablauf der Clearingfrist für die KBKA?) then (ja)
    :A01;
    note left
        Fristüberschreitung
    endnote
    kill;
else (nein)
endif
if (<b>2: </b> Befindet sich der MaBiS-ZP auf der Aggregationsebene RZ?) then (ja)
    if (<b>5: </b> Hat der BKV dem BIKO für diesen Bilanzierungsmonat bereits mitgeteilt, dass die weiteren Prüfungen auf Ebene des BG stattfinden müssen?) then (ja)
        :A03;
        note left
            Falsche Aggregationsebene RZ
        endnote
        kill;
    else (nein)
    endif
else (nein)
    if (<b>3: </b> Hat der BKV für den BK dieses MaBiS-ZP in diesem Bilanzierungsmonat die Aggregationsebene RZ abbestellt?) then (ja)
    else (nein)
        if (<b>4: </b> Hat der BKV dem BIKO für diesen Bilanzierungsmonat bereits mitgeteilt, dass die weiteren Prüfungen auf Ebene des BG stattfinden müssen?) then (ja)
        else (nein)
            :A02;
            note left
                Falsche Aggregationsebene BG
            endnote
            kill;
        endif
    endif
endif
end

@enduml
